# 1、ER图工具的学习；2、UML工具的学习；3、思维导图的学习。

# 1.1 需求文档
# 用户端的需求如下：
# 1、要能够通过搜索引擎搜索到博客内容，进而来到博客；
# 2、可在博客中进行关键词搜索，然后展示出文章列表；
# 3、能够根据某个分类查看所有关于这一分类的文章；
# 4、访问首页时，需要能看到由新到旧的文章列表，以便于查看最新的文章；
# 5、要能够通过 RSS 阅读器订阅博主的文章；
# 6、要能够对某一篇文章进行评论；
# 7、能够配置友链，方便与网友进行链接。

# 作者端的需求如下：
# 1、博客后台需要登录方可进入；
# 2、能够创建分类和标签；
# 3、能够以 Markdown 格式编写文章；
# 4、能够上传文章配图，要有版权声明；
# 5、能够配置导航，以便引导读者；
# 6、作者更新后，订阅读者能够收到通知。

# 1.2 需求评审/分析
# 对技术来说，评审的目的有如下三个：
# 1、明确所有的需求点，避免出现理解上的歧义；
# 2、确认技术可行性，避免延期或者后面再修改需求；
# 3、确认工期，是否需要分期开发。
#
# 1.2.1 博客需求评审
# 1 用户端部分；2. 作者端需求
#
# 1.3 功能分析
# 1.3.1 需求列表，1、用户端部分，2、作者端需求
# 1.3.2 功能点梳理
# 1.3.3 模块划分，建模：建立系统模型和数据模型；UML画出用例图，整理用户需求；
# 然后画出序列图，整理出系统各模块的交互逻辑；最后用这些模型实现；使用ER图来梳理数据模型间的关系。
# 通过思维导图梳理功能点后，拆分为独立的任务放到Trello的card上/Jira上，方便管理开发进度。
#
# 1.4 模块划分，考虑使用 UML 工具进行建模，1.4.1 实体及关系，1.4.2 模块划分。



